def greedy_subset_sum(S):
  """
  Решает задачу о суммах подмножеств, используя жадный алгоритм.

  Аргументы:
    S: множество положительных целых чисел.

  Возвращает:
    Два подмножества S1 и S2.
  """

  # Отсортировать множество S в порядке убывания
  S.sort(reverse=True)

  # Инициализировать суммы
  sum1 = 0
  sum2 = 0

  # Создать подмножества
  S1 = []
  S2 = []

  # Пройти по отсортированному множеству
  for num in S:
    if sum1 <= sum2:
      S1.append(num)
      sum1 += num
    else:
      S2.append(num)
      sum2 += num

  # Вернуть подмножества
  return S1, S2

S = [1, 2, 3, 4, 5]
S1, S2 = greedy_subset_sum(S)

print("S1:", S1)
print("S2:", S2)